<template>
    <div>
        <main class="overflow-hidden ">
        <!--Start cart area-->
            <section class="cart-area pt-60 pb-60">
                <div class="container">
                    <h4>
                        Опис сайту
                    </h4>
                    <p>
                        <a href="http://clothingstore.ho.ua/">clothingstore.ho.ua</a> -  інтернет-магазин одягу та взуття
                    </p>
                    <p>
                        В клієнтській частині сайту реалізовані такі можливості: перегляд всіх товарів за фільтром та пошуком, 
                        перегляд інформації окремого товара, перегляд та додавання відгуків, порівняння товарів, внесення товару 
                        до списку улюблених та окремо перегляд списку цих товарів, внесення товару до кошика, оформлення замовлення та покупка 
                        (внесення даних замовлення до бази даних), вхід (функція Забули пароль відсутня через неможливість реалізації 
                        на даному хостингу), реєстрація, зміна пароля.
                    </p>
                    <p>
                        В адміністративній частині реалізовані такі можливості: додавання, редагування, перегляд товарів та супутніх атрибутів товарів, 
                        а також, користувачів. Перегляд і редагування замовлень та відгуків. Відгуки з’являються на сайті тільки після перегляду та 
                        дозволу публікації через адміністративну частину сайту. Також реалізовані права доступу до функцій адміністративної частини сайту.
                    </p>
                    <p>
                        Для входу в адміністративну частину - login: clothingstore_20, password: clothingstore_20. Цей аккаунт має права адміністратора, 
                        але відсутня функція видалення даних  
                    </p>
                    <p>
                        При розробці сайту були використані такі технології: PHP, JS, Laravel, Vue, MySQL, HTML, CSS, Git
                    </p>
                </div>
            </section>
        <!--End cart area-->
        </main>
    </div>
</template>

<script>

export default {
    name: "Index"
}
</script>

<style scoped>
    h4{
        margin-top: -30px;
        margin-bottom: 10px;
        text-align: center; 
    }
   .container{
       max-width:992px;
       margin: 0px auto;
       text-align: justify;
       font-size:16px;
       color:black;
   } 
</style>
